#include "workerManager.h"
#include <iostream>
using namespace std;

//构造函数
WorkerManager::WorkerManager()
{

}

//菜单界面
void WorkerManager::Show_Menu()
{
	cout << "**********************************************************\n" << endl;
	cout << "*******************   职工管理系统   *********************\n" << endl;
	cout << "*******************===================********************\n" << endl;
	cout << "***************      1 增加职工信息      *****************\n" << endl;
	cout << "***************      2 删除离职职工      *****************\n" << endl;
	cout << "***************      3 修改职工信息      *****************\n" << endl;
	cout << "***************      4 查找职工信息      *****************\n" << endl;
	cout << "***************      5 显示职工信息      *****************\n" << endl;
	cout << "***************      6 按照编号排序      *****************\n" << endl;
	cout << "***************      7 清空所有文档      *****************\n" << endl;
	cout << "***************      0 退出管理程序      *****************\n" << endl;
	cout << "*****************=====================********************" << endl;
	cout << endl;
}

//退出系统
void WorkerManager::ExitSystem()
{
	cout << "欢迎下次使用" << endl;
	system("pause");
	exit(0);
}

//析构函数
WorkerManager::~WorkerManager()
{

}

